String aya = 'قال تعالى : "وَلِلّهِ الأَسْمَاء الْحُسْنَى فَادْعُوهُ بِهَا وَذَرُواْ الَّذِينَ يُلْحِدُونَ فِي أَسْمَآئِهِ سَيُجْزَوْنَ مَا كَانُواْ يَعْمَلُونَ"';

List godNames = [
  {
    "name": "الله",
    "desc": "المألوه أي المعبود أو المستحق للعبادة لما اتصف به من صفات الألوهية"
  },
  {
    "name": "الرحمن",
    "desc": "كثير الرحمة وهو اسم مقصور على الله عز وجل ولا يجوز أن يقال رحمن لغير الله، وذلك لأن رحمته وسعت كل شيء وهو أرحم الراحمين"
  },
  {"name": "الرحيم", "desc": "هو المنعم أبدا، المتفضل دوما، فرحمته لا تنتهي"},
  {
    "name": "الملك",
    "desc": "هو الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق فهو المالك المطلق"
  },
  {
    "name": "القدوس",
    "desc": "الطاهر المنزه عن العيوب والنقائص وعن كل ما تحيط به العقول"
  },
  {
    "name": "السلام",
    "desc": "هو ناشر السلام بين الأنام وهو الذي سلمت ذاته من النقص والعيب والفناء"
  },
  {
    "name": "المؤمن",
    "desc": "هو الذي سلم أوليائه من عذابه، والذي يصدق عباده ما وعدهم"
  },
  {
    "name": "المهيمن",
    "desc":  " القائم على خلقه بأعمالهم، وأرزاقهم وآجالهم، المسؤول عنهم بالرعاية والوقاية"
  },
  {
    "name": "العزيز",
    "desc":"هو المنفرد بالعزة، الظاهر الذي لا يقهر، القوي الممتنع فلا يغلبه شيء وهو غالب علي كل شيء"
  },
  {
    "name": "الجبار",
    "desc": " الذي تنفذ مشيئته، ولا يخرج أحد عن تقديره، وهو القاهر لخلقه على ما أراد"
  },
  {
    "name": "المتكبر",
    "desc": "هو المتعالى عن صفات الخلق المنفرد بالعظمة والكبرياء"
  },
  {
    "name": "الخالق",
    "desc": "هو الفاطر المبدع لكل شيء، والمقدر له والموجد للأشياء من العدم، فهو خالق كل صانع وصنعته"
  },
  {
    "name": "البارئ",
    "desc": "هو الذي خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود"
  },
  {
    "name": "المصور",
    "desc": "فأعطى كل شيء منها صورة خاصة، وهيئة منفردة، يتميز بها على اختلافها وكثرتها"
  },
  {
    "name": "الغفار",
    "desc": "هو وحده الذي يغفر الذنوب ويستر العيوب في الدنيا والآخرة"
  },
  {
    "name": "القهار",
    "desc":" الغالب الذي قهر خلقه بسلطانه وقدرته، وصرفهم على ما أراد طوعا وكرها، وخضع لجلاله كل شيء"
  },
  {
    "name": "الوهاب",
    "desc": "هو المنعم على العباد، الذي يهب بغير عوض ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء"
  },
  {
    "name": "الرزاق",
    "desc": "هو الذي خلق الأرزاق وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته ويصلحه"
  },
  {
    "name": "الفتاح",
    "desc": "هو الذي يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض"
  },
  {
    "name": "العليم",
    "desc": "هو الذي يعلم تفاصيل الأمور، ودقائق الأشياء وخفايا الضمائر، والنفوس، لا يغرب عن ملكه مثقال ذرة، فعلمه يحيط بجميع الأشياء"
  },
  {
    "name": "القابض",
    "desc":"هو الذي يقبض الرزق عمن يشاء من الخلق بعدله، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط"
  },
  {
    "name": "الباسط",
    "desc": "اي يقتر على من يشاء ويوسع على من يشاء على حسب ما يرى من المصلحة لعباده"
  },
  {
    "name": "الخافض",
    "desc": "هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات وهو رافع السماوات"
  },
  {
    "name": "الرافع",
    "desc": "هو الذي رفع أولياءه بالطاعة فيعلي مراتبهم وينصرهم على أعدائه ويجعل العاقبة لهم، لا يعلو إلا من رفعه الله، ولا يتضع إلا من وضعه وخفضه"
  },
  {
    "name": "المعز",
    "desc": "هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله"
  },
  {"name": "المذل", "desc": "المذل للكافرين بعصيانهم"},
  {
    "name": "السميع",
    "desc": "هو الذي لا يخفى عليه شيء في الأرض ولا في السماء وهو السميع البصير"
  },
  {
    "name": "البصير",
    "desc": "هو الذي يرى الأشياء كلها ظاهرها وباطنها وهو المحيط بكل شيئ علماً"
  },
  {
    "name": "الحكم",
    "desc":"هو الذي يفصل بين مخلوقاته بما شاء ويفصل بين الحق والباطل لا راد لقضائه ولا معقب لحكمه"
  },
  {
    "name": "العدل",
    "desc": "هو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه"
  },
  {
    "name": "اللطيف",
    "desc": "هو البر الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم"
  },
  {
    "name": "الخبير",
    "desc":"هو العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء فهو العالم بما كان ويكون"
  },
  {
    "name": "الحليم",
    "desc": "هو الصبور الذي يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع"
  },
  {
    "name": "العظيم",
    "desc": "هو الذي ليس لعظمته بداية ولا لجلاله نهاية، وليس كمثله شيء"
  },
  {
    "name": "الغفور",
    "desc": "هو الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم"
  },
  {
    "name": "الشكور",
    "desc": "هو الذي يزكو عنده القليل من أعمال العباد، فيضاعف لهم الجزاء، وشكره لعباده مغفرته لهم"
  },
  {
    "name": "العلي",
    "desc": "هو الرفيع القدر فلا يحيط به وصف الواصفين المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتا وقهرا وشأنا"
  },
  {
    "name": "الكبير",
    "desc": "هو العظيم الجليل ذو الكبرياء في صفاته وأفعاله فلا يحتاج إلى شيء ولا يعجزه شيء (ليس كمثله شيء)"
  },
  {
    "name": "الحفيظ",
    "desc": "هو الذي لا يغرب عن حفظه شيء ولو كمثقال الذر فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل"
  },
  {
    "name": "المقيت",
    "desc":  "هو المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد"
  },
  {
    "name": "الحسيب",
    "desc": "هو الكافي الذي منه كفاية العباد وهو الذي عليه الإعتماد يكفي العباد بفضله"
  },
  {
    "name": "الجليل",
    "desc": "هو العظيم المطلق المتصف بجميع صفات الكمال والمنعوت بكمالها المنزه عن كل نقص"
  },
  {
    "name": "الكريم",
    "desc": "هو الكثير الخير الجواد المعطي الذي لا ينفذ عطاؤه وهو الكريم المطلق الجامع لأنواع الخير والشرف والفضائل المحمود بافعاله"
  },
  {
    "name": "الرقيب",
    "desc":"هو الرقيب الذي يراقب أحوال العباد ويعلم أقوالهم ويحصي أعمالهم وهو الحافظ الذي لا يغيب عنه شيء"
  },
  {
    "name": "المجيب",
    "desc":  "هو الذي يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يسأل أحد سواه"
  },
  {
    "name": "الواسع",
    "desc": "هو الذي وسع رزقه جميع خلقه، وسعت رحمته كل شيء المحيط بكل شيء"
  },
  {
    "name": "الحكيم",
    "desc":"اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل"
  },

  {
    "name": "الودود",
    "desc":" المتحبب إلى خلقه محب لهم والمحبوب في قلوب أوليائه"
  },
  {
    "name": "المجيد",
    "desc":"هو البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر"
  },
  {
    "name": "الباعث",
    "desc": "هو باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد"
  },
  {
    "name": "الشهيد",
    "desc": "هو الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله"
  },
  {
    "name": "الحق",
    "desc": "هو الذي يحق الحق بكلماته ويؤيد أولياءه فهو المستحق للعبادة"
  },
  {
    "name": "الوكيل",
    "desc":"هو الكفيل بالخلق القائم بأمورهم فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه"
  },
  {
    "name": "القوي",
    "desc": "هو صاحب القدرة التامة البالغة الكمال غالب لا يغلب فقوته فوق كل قوة"
  },
  {
    "name": "المتين",
    "desc": "هو الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا إلى معين"
  },
  {
    "name": "الولي",
    "desc":"هو المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي لأمور الخلائق ويحفظهم"
  },
  {
    "name": "الحميد",
    "desc": "هو المستحق للحمد والثناء، الذي لا يحمد على مكروه سواه"
  },
  {
    "name": "المحصي",
    "desc": "هو الذي أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل"
  },
  {
    "name": "المبدئ",
    "desc": "هو الذي أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال"
  },
  {
    "name": "المعيد",
    "desc":"هو الذي يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة"
  },
  {
    "name": "المحيي",
    "desc":"هو خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت"
  },
  {
    "name": "المميت",
    "desc": "هو مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء"
  },
  {
    "name": "الحي",
    "desc": "هو المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية فهو الباقي أزلا وأبدا وهو الحي الذي لا يموت"
  },
  {
    "name": "القيوم",
    "desc": "هو القائم بنفسه، الغني عن غيره، وهو القائم بتدبير أمر خلقه في إنشائهم ورزقهم"
  },
  {
    "name": "الواجد",
    "desc":"هو الذي لا يعوزه شيء ولا يعجزه شيء يجد كل ما يطلبه، ويدرك كل ما يريده"
  },
  {
    "name": "الماجد",
    "desc": "العز الباهي، له العز في الأوصاف والأفعال الذي يعامل العباد بالجود والرحمة"
  },
  {
    "name": "الواحد",
    "desc": "هو الفرد المتفرد في ذاته وصفائه وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه"
  },
  {
    "name": "الصمد",
    "desc": "هو المطاع الذي لا يقضى دونه أمر، الذي يقصد وحده في الحوائج فهو مقصد عباده في مهمات دينهم ودنياهم"
  },
  {
    "name": "القادر",
    "desc": "هو الذي يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدا عليه ولا ناقصا عنه"
  },
  {
    "name": "المقتدر",
    "desc": "هو الذي يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره"
  },
  {
    "name": "المقدم",
    "desc": "هو الذي يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه"
  },
  {
    "name": "المؤخر",
    "desc": "هو الذي يؤخر الأشياء فيضعها في مواضعها المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير"
  },
  {
    "name": "الاول",
    "desc": "هو الذي لم يسبقه في الوجود شيء فهو أول قبل الوجود"
  },
  {
    "name": "الاخر",
    "desc":"هو الباقي بعد فناء خلقه، البقاء الأبدي يفنى الكل وله البقاء وحده، فليس بعده شيء"
  },
  {
    "name": "الظاهر",
    "desc": "هو الذي ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله"
  },
  {
    "name": "الباطن",
    "desc": "هو العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد"
  },
  {
    "name": "الوالي",
    "desc": "هو المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه"
  },
  {
    "name": "المتعال",
    "desc": "هو الذي جل عن إفك المفترين، وتنزه عن وساوس المتحيرين"
  },
  {
    "name": "البر",
    "desc": "هو العطوف على عباده ببره ولطفه، ومن على السائلين بحسن عطائه، وهو الصادق فيما وعد"
  },
  {
    "name": "التواب",
    "desc": " هو الذي يلهم عباده التوبة ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بغفران الذنوب"
  },
  {
    "name": "المنتقم",
    "desc": "هو الذي يقسم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار"
  },
  {
    "name": "العفو",
    "desc":"هو الذي يترك المؤاخدة على الذنوب ولا يذكرك بالعيوب فهو يمحو السيئات ويتجاوز عن المعاصي"
  },
  {
    "name": "الرءوف",
    "desc":"هو المتعطف على المذنبين بالتوبة، الذي جاد بلطفه ومن بتعطفه، يستر العيوب ثم يعفو عنها"
  },
  {
    "name": "مالك الملك",
    "desc":" المتصرف في ملكه كيف يشاء لا رادّ لحكمه، ولا معقب لأمره"
  },
  {
    "name": "ذو الجلال والاكرام",
    "desc":"  المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يُجلّ"
  },
  {
    "name": "المقسط",
    "desc":"هو العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم"
  },
  {
    "name": "الجامع",
    "desc": "هو الذي جمع الكمالات كلها، ذاتا ووصفا وفعلا، الذي يجمع بين الخلائق المتماثلة والمتباينة، والذي يجمع الأولين والآخرين"
  },
  {
    "name": "الغني",
    "desc": "هو الذي لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه"
  },
  {
    "name": "المغني",
    "desc": "هو معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده"
  },
  {
    "name": "المانع",
    "desc": "هو الذي أعطى كل شيء، ويمنع العطاء عن من يشاء ابتلاء أو حماية"
  },
  {
    "name": "الضار",
    "desc": "هو المقدر للضر على من أراد كيف أراد، والمقدر للنفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه"
  },
  {
    "name": "النافع",
    "desc":"و النافع الذي يصدر منه الخير والنفع في الدنيا والآخرة قال الله﴿يَدْعُو لَمَنْ ضَرُّهُ أَقْرَبُ مِنْ نَفْعِهِ﴾"
  },
  {
    "name": "النور",
    "desc":"هو الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره"
  },
  {
    "name": "الهادي",
    "desc":"هو المبين للخلق طريق الحق بكلامه يهدي القلوب إلى معرفته، والنفوس إلى طاعته"
  },
  {
    "name": "البديع",
    "desc": "هو الذي لا يماثله أحد في صفاته ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال"
  },
  {
    "name": "الباقي",
    "desc": "هو وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء"
  },
  {
    "name": "الوارث",
    "desc":"هو الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها"
  },
  {
    "name": "الرشيد",
    "desc": "هو الذي أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد"
  },
  {
    "name": "الصبور",
    "desc": "هو الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر، ولا يسرع بالفعل قبل أوانه"
  },
];
